COMMAND_NAME = '@...'
BOT_NAME = 'No name Bot'
TELEGRAM_CHANEL_SUBSCRIBE = 'https://t.me/dbfsfg'
URL = '127.0.0.1:8000'
REQUEST_POSITION_URL = 'http://{}/api/request_position/'.format(URL)
REQUEST_STOCK_URL = 'http://{}/api/request_stock/'.format(URL)
POSITION_PATTERN = r"^(?P<articul>\d+)(?P<phrase>(\s+[a-zA-Zа-яА-ЯёЁ]+)+)"

WAREHOUSES = {
    1733: 'Екатеринбург',
    507: 'Коледино',
    124731: 'Крёкшино КБТ',
    686: 'Новосибирск',
    2737: 'Санкт-Петербург',
    117986: 'Казань',
    130744: 'Краснодар',
    117501: 'Подольск',
    204939: 'Казахстан',
    159402: 'Санкт-Петербург Шушары',
    205228: 'Белая Дача',
    120762: 'Электросталь',
    121709: 'Электросталь КБТ',
    206348: 'Тула',
    206968: 'Чехов',
    208941: 'Домодедово',
    208277: 'Невинномысск',
    210001: 'Чехов 2',
    210515: 'Вёшки',
    211622: 'Минск',
    1193: 'Хабаровск',
    207743: 'Пушкино',
    218210: 'Обухово',
    218623: 'Подольск 3'
}

# После получения доступа к каналу подписки с правами админа
# TELEGRAM_CHANEL_SUBSCRIBE = 'https://t.me/mpexperts'
