START_BOT_DESCRIPTION_MESSAGE = (
    "Привет! На связи команда {}\n"
    "Мы создали этого бота для помощи всем действующим поставщикам "
    "Wildberries.\n\n"
    "Здесь вы можете:\n"
    "- отследить позиции вашей карточки в выдаче.\n"
    "- увидеть остатки товара по складам\n"
    "- узнать остатки товара по размерам.\n\n"
    "Для начала работы нажмите Start"
)
START_MESSAGE = (
    "Привет! Чтобы воспользоваться ботом, нужно подписаться на наш "
    "telegram канал {}"
)
SUCCESS_SUBSCRIBE_MESSAGE = (
    "Спасибо за подписку! Вы можете воспользоваться меню бота:"
)
FALSE_SUBSCRIBE_MESSAGE = (
    "Вы не подписались на наш telegram канал"
)
HELLO_MESSAGE = (
    "Добро пожаловать в {}\n"
    "Узнайте на каких позициях находится ваш товар в поиске Wildberries."
)
POSITION_PARSER_MESSAGE = (
    "Для определения позиции артикула отправьте сообщение в формате\n"
    "'Артикул Поисковая фраза'\n\n"
    "Например:\n36704403 футболка женская"
)
POSITION_PARSER_EXPECTATION_MESSAGE = (
    "Запрос с артикулом *{}* и поисковой фразой "
    "*{}* поставлен в очередь на получение позиции"
)
POSITION_PARSER_RESULT_MESSAGE = "Результат запроса. Товар на {} месте"
POSITION_PARSER_SUBSCRIBE_MESSAGE = (
    "Вы подписались на обновление каждые {} час(ов)"
)
LEFTOVERS_PARSER_MESSAGE = (
    "Отправьте артикул для вывода остатков:\n"
    "Например:\n"
    "36704403\n"
)
LEFTOVERS_PARSER_RESULT_MESSAGE = "остатки по складам и по размерам {}"
ACCEPTANCE_RATE_MESSAGE = "Выберите склад:\nНапример:\nАстрахань"
ACCEPTANCE_RATE_ANSWER_MESSAGE = (
    "Коэффицианта приемки для склада {} составляет {}"
)
SUBSCRIPTIONS_MESSAGE = "Вы подписаны на позиции: {}"
UNKNOWN_COMMAND_MESSAGE = (
    "Я пока не знаю такой команды. Вы можете воспользоваться меню бота:"
)
TO_MAIN_MENU_MESSAGE = "Спасибо за подписку!"
